Revit 2027 API
FitDirectionType Enumeration
 This enum is used to define the direction to fit the number of pixels defined by PixelSize.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FitDirectionType
Public Enumeration FitDirectionType
public enum class FitDirectionType
type FitDirectionType
Members
Member name | Value | Description
Horizontal | 0 |  Fit a specific number of pixels in horizontal direction.
Vertical | 1 |  Fit a specific number of pixels in vertical direction.
See Also
Reference
Autodesk.Revit.DB Namespace